---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletedRequestedWarn
source: html/9ccb41fa-edc5-e05a-b441-183f774167b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletedRequestedWarn Property

You have deleted elements that other users requested.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletedRequestedWarn { get; }
```